In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'], 'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})

In [5]:
dframe

   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha
1 -0.071191  1.013023  X   beta
2  1.427867 -1.074381  Y  alpha
3  0.770041  0.729447  Y   beta
4 -1.108862 -0.329015  Z  alpha

In [6]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [7]:
group1

In [8]:
group1.mean()

k1
X   -0.255487
Y    1.098954
Z   -1.108862
Name: dataset1, dtype: float64

In [12]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [16]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -0.071191
    JAN    1.427867
NY  FEB    0.770041
    JAN   -0.774322
Name: dataset1, dtype: float64

In [17]:
dframe

   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha
1 -0.071191  1.013023  X   beta
2  1.427867 -1.074381  Y  alpha
3  0.770041  0.729447  Y   beta
4 -1.108862 -0.329015  Z  alpha

In [18]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.255487  0.483929
Y   1.098954 -0.172467
Z  -1.108862 -0.329015

In [19]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.439783 -0.045166
   beta  -0.071191  1.013023
Y  alpha  1.427867 -1.074381
   beta   0.770041  0.729447
Z  alpha -1.108862 -0.329015

In [25]:
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [28]:
for k1, group in dframe.groupby('k1'):
    print "This is the %s group" %k1
    print group
    print "\n"

This is the X group
   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha
1 -0.071191  1.013023  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  1.427867 -1.074381  Y  alpha
3  0.770041  0.729447  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -1.108862 -0.329015  Z  alpha

In [23]:
dframe

   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha
1 -0.071191  1.013023  X   beta
2  1.427867 -1.074381  Y  alpha
3  0.770041  0.729447  Y   beta
4 -1.108862 -0.329015  Z  alpha

In [30]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print "key1 = %s key2 %s" %(k1, k2)
    print group
    print '\n'

key1 = X key2 alpha
   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha


key1 = X key2 beta
   dataset1  dataset2 k1    k2
1 -0.071191  1.013023  X  beta


key1 = Y key2 alpha
   dataset1  dataset2 k1     k2
2  1.427867 -1.074381  Y  alpha


key1 = Y key2 beta
   dataset1  dataset2 k1    k2
3  0.770041  0.729447  Y  beta


key1 = Z key2 alpha
   dataset1  dataset2 k1     k2
4 -1.108862 -0.329015  Z  alpha

In [35]:
group_dict = dict(list((dframe.groupby('k1'))))
group_dict

{'X':    dataset1  dataset2 k1     k2
 0 -0.439783 -0.045166  X  alpha
 1 -0.071191  1.013023  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2  1.427867 -1.074381  Y  alpha
 3  0.770041  0.729447  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4 -1.108862 -0.329015  Z  alpha}

In [33]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha
1 -0.071191  1.013023  X   beta

In [51]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis = 1)))

In [52]:
dframe

   dataset1  dataset2 k1     k2
0 -0.439783 -0.045166  X  alpha
1 -0.071191  1.013023  X   beta
2  1.427867 -1.074381  Y  alpha
3  0.770041  0.729447  Y   beta
4 -1.108862 -0.329015  Z  alpha

In [60]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.439783 -0.045166
 1 -0.071191  1.013023
 2  1.427867 -1.074381
 3  0.770041  0.729447
 4 -1.108862 -0.329015, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [66]:
group_dict_axis1[np.dtype(np.float64)]

   dataset1  dataset2
0 -0.439783 -0.045166
1 -0.071191  1.013023
2  1.427867 -1.074381
3  0.770041  0.729447
4 -1.108862 -0.329015

In [56]:
dataset2_group = dframe.groupby(['k1','k2'])['dataset2']
dataset2_group.mean